Use Mermaid diagram instead of ASCII art
It's easier to maintain a Mermaid diagram, and it's automatically
rendered by GitHub.
